zengwangfa/Underwater-Vehicle/software/18.8.21最终)/Chip/inc/kinetis/MK61F15.h
/*
** ###################################################################
**     Compilers:           Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    K61P256M150SF3RM, Rev. 0, May 2011
**     Version:             rev. 1.0, 2011-08-12
**
**     Abstract:
**         This header file implements peripheral memory map for MK61F15
**         processor.
**
**     Copyright: 1997 - 2011 Freescale Semiconductor, Inc. All Rights Reserved.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 1.0 (2011-08-12)
**         Initial version.
**
** ###################################################################
*/

/**
 * @file MK61F15.h
 * @version 1.0
 * @date 2011-08-12
 * @brief Peripheral memory map for MK61F15
 *
 * This header file implements peripheral memory map for MK61F15 processor.
 */


/* ----------------------------------------------------------------------------
   -- MCU activation
   ---------------------------------------------------------------------------- */

/* Prevention from multiple including the same memory map */
#if !defined(MCU_MK61F12) && !defined(MCU_MK61F15)  /* Check if memory map has not been already included */
#define MCU_MK61F12
#define MCU_MK61F15

/* Check if another memory map has not been also included */
#if (defined(MCU_ACTIVE))
  #error MK61F15 memory map: There is already included another memory map. Only one memory map can be included.
#endif /* (defined(MCU_ACTIVE)) */
#define MCU_ACTIVE

#include <stdint.h>

/** Memory map version 1.0 */
#define MCU_MEM_MAP_VERSION 0x0100u

/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG(Reg,Bit) (*((uint32_t volatile*)(0x42000000u + (32u*((uint32_t)&(Reg) - (uint32_t)0x40000000u)) + (4u*((uint32_t)(Bit))))))

/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
typedef enum {
  INT_Initial_Stack_Pointer    = 0,                /**< Initial stack pointer */
  INT_Initial_Program_Counter  = 1,                /**< Initial program counter */
  INT_NMI                      = 2,                /**< Non-maskable interrupt */
  INT_Hard_Fault               = 3,                /**< Hard fault exception */
  INT_Mem_Manage_Fault         = 4,                /**< Memory Manage Fault */
  INT_Bus_Fault                = 5,                /**< Bus fault exception */
  INT_Usage_Fault              = 6,                /**< Usage fault exception */
  INT_Reserved7                = 7,                /**< Reserved interrupt 7 */
  INT_Reserved8                = 8,                /**< Reserved interrupt 8 */
  INT_Reserved9                = 9,                /**< Reserved interrupt 9 */
  INT_Reserved10               = 10,               /**< Reserved interrupt 10 */
  INT_SVCall                   = 11,               /**< A supervisor call exception */
  INT_DebugMonitor             = 12,               /**< Debug Monitor */
  INT_Reserved13               = 13,               /**< Reserved interrupt 13 */
  INT_PendableSrvReq           = 14,               /**< PendSV exception - request for system level service */
  INT_SysTick                  = 15,               /**< SysTick interrupt */
  INT_DMA0_DMA16               = 16,               /**< DMA channel 0/16 transfer complete interrupt */
  INT_DMA1_DMA17               = 17,               /**< DMA channel 1/17 transfer complete interrupt */
  INT_DMA2_DMA18               = 18,               /**< DMA channel 2/18 transfer complete interrupt */
  INT_DMA3_DMA19               = 19,               /**< DMA channel 3/19 transfer complete interrupt */
  INT_DMA4_DMA20               = 20,               /**< DMA channel 4/20 transfer complete interrupt */
  INT_DMA5_DMA21               = 21,               /**< DMA channel 5/21 transfer complete interrupt */
  INT_DMA6_DMA22               = 22,               /**< DMA channel 6/22 transfer complete interrupt */
  INT_DMA7_DMA23               = 23,               /**< DMA channel 7/23 transfer complete interrupt */
  INT_DMA8_DMA24               = 24,               /**< DMA channel 8/24 transfer complete interrupt */
  INT_DMA9_DMA25               = 25,               /**< DMA channel 9/25 transfer complete interrupt */
  INT_DMA10_DMA26              = 26,               /**< DMA channel 10/26 transfer complete interrupt */
  INT_DMA11_DMA27              = 27,               /**< DMA channel 11/27 transfer complete interrupt */
  INT_DMA12_DMA28              = 28,               /**< DMA channel 12/28 transfer complete interrupt */
  INT_DMA13_DMA29              = 29,               /**< DMA channel 13/29 transfer complete interrupt */
  INT_DMA14_DMA30              = 30,               /**< DMA channel 14/30 transfer complete interrupt */
  INT_DMA15_DMA31              = 31,               /**< DMA channel 15/31 transfer complete interrupt */
  INT_DMA_Error                = 32,               /**< DMA error interrupt */
  INT_MCM                      = 33,               /**< Normal interrupt */
  INT_FTFE                     = 34,               /**< FTFE interrupt */
  INT_Read_Collision           = 35,               /**< Read collision interrupt */
  INT_LVD_LVW                  = 36,               /**< Low Voltage Detect, Low Voltage Warning */
  INT_LLW                      = 37,               /**< Low Leakage Wakeup */
  INT_Watchdog                 = 38,               /**< WDOG interrupt */
  INT_RNG                      = 39,               /**< RNGA interrupt */
  INT_I2C0                     = 40,               /**< I2C0 interrupt */
  INT_I2C1                     = 41,               /**< I2C1 interrupt */
  INT_SPI0                     = 42,               /**< SPI0 interrupt */
  INT_SPI1                     = 43,               /**< SPI1 interrupt */
  INT_SPI2                     = 44,               /**< SPI2 interrupt */
  INT_CAN0_ORed_Message_buffer = 45,               /**< CAN0 OR'd message buffers interrupt */
  INT_CAN0_Bus_Off             = 46,               /**< CAN0 bus off interrupt */
  INT_CAN0_Error               = 47,               /**< CAN0 error interrupt */
  INT_CAN0_Tx_Warning          = 48,               /**< CAN0 Tx warning interrupt */
  INT_CAN0_Rx_Warning          = 49,               /**< CAN0 Rx warning interrupt */
  INT_CAN0_Wake_Up             = 50,               /**< CAN0 wake up interrupt */
  INT_I2S0_Tx                  = 51,               /**< I2S0 transmit interrupt */
  INT_I2S0_Rx                  = 52,               /**< I2S0 receive interrupt */
  INT_CAN1_ORed_Message_buffer = 53,               /**< CAN1 OR'd message buffers interrupt */
  INT_CAN1_Bus_Off             = 54,               /**< CAN1 bus off interrupt */
  INT_CAN1_Error               = 55,               /**< CAN1 error interrupt */
  INT_CAN1_Tx_Warning          = 56,               /**< CAN1 Tx warning interrupt */
  INT_CAN1_Rx_Warning          = 57,               /**< CAN1 Rx warning interrupt */
  INT_CAN1_Wake_Up             = 58,               /**< CAN1 wake up interrupt */
  INT_Reserved59               = 59,               /**< Reserved interrupt 59 */
  INT_UART0_LON                = 60,               /**< UART0 LON interrupt */
  INT_UART0_RX_TX              = 61,               /**< UART0 receive/transmit interrupt */
  INT_UART0_ERR                = 62,               /**< UART0 error interrupt */
  INT_UART1_RX_TX              = 63,               /**< UART1 receive/transmit interrupt */
  INT_UART1_ERR                = 64,               /**< UART1 error interrupt */
  INT_UART2_RX_TX              = 65,               /**< UART2 receive/transmit interrupt */
  INT_UART2_ERR                = 66,               /**< UART2 error interrupt */
  INT_UART3_RX_TX              = 67,               /**< UART3 receive/transmit interrupt */
  INT_UART3_ERR                = 68,               /**< UART3 error interrupt */
  INT_UART4_RX_TX              = 69,               /**< UART4 receive/transmit interrupt */
  INT_UART4_ERR                = 70,               /**< UART4 error interrupt */
  INT_UART5_RX_TX              = 71,               /**< UART5 receive/transmit interrupt */
  INT_UART5_ERR                = 72,               /**< UART5 error interrupt */
  INT_ADC0                     = 73,               /**< ADC0 interrupt */
  INT_ADC1                     = 74,               /**< ADC1 interrupt */
  INT_CMP0                     = 75,               /**< CMP0 interrupt */
  INT_CMP1                     = 76,               /**< CMP1 interrupt */
  INT_CMP2                     = 77,               /**< CMP2 interrupt */
  INT_FTM0                     = 78,               /**< FTM0 fault, overflow and channels interrupt */
  INT_FTM1                     = 79,               /**< FTM1 fault, overflow and channels interrupt */
  INT_FTM2                     = 80,               /**< FTM2 fault, overflow and channels interrupt */
  INT_CMT                      = 81,               /**< CMT interrupt */
  INT_RTC                      = 82,               /**< RTC interrupt */
  INT_RTC_Seconds              = 83,               /**< RTC seconds interrupt */
  INT_PIT0                     = 84,               /**< PIT timer channel 0 interrupt */
  INT_PIT1                     = 85,               /**< PIT timer channel 1 interrupt */
  INT_PIT2                     = 86,               /**< PIT timer channel 2 interrupt */
  INT_PIT3                     = 87,               /**< PIT timer channel 3 interrupt */
  INT_PDB0                     = 88,               /**< PDB0 interrupt */
  INT_USB0                     = 89,               /**< USB0 interrupt */
  INT_USBDCD                   = 90,               /**< USBDCD interrupt */
  INT_ENET_1588_Timer          = 91,               /**< Ethernet MAC IEEE 1588 timer interrupt */
  INT_ENET_Transmit            = 92,               /**< Ethernet MAC transmit interrupt */
  INT_ENET_Receive             = 93,               /**< Ethernet MAC receive interrupt */
  INT_ENET_Error               = 94,               /**< Ethernet MAC error and miscelaneous interrupt */
  INT_Reserved95               = 95,               /**< Reserved interrupt 95 */
  INT_SDHC                     = 96,               /**< SDHC interrupt */
  INT_DAC0                     = 97,               /**< DAC0 interrupt */
  INT_DAC1                     = 98,               /**< DAC1 interrupt */
  INT_TSI0                     = 99,               /**< TSI0 interrupt */
  INT_MCG                      = 100,              /**< MCG interrupt */
  INT_LPTimer                  = 101,              /**< LPTimer interrupt */
  INT_Reserved102              = 102,              /**< Reserved interrupt 102 */
  INT_PORTA                    = 103,              /**< Port A interrupt */
  INT_PORTB                    = 104,              /**< Port B interrupt */
  INT_PORTC                    = 105,              /**< Port C interrupt */
  INT_PORTD                    = 106,              /**< Port D interrupt */
  INT_PORTE                    = 107,              /**< Port E interrupt */
  INT_PORTF                    = 108,              /**< Port F interrupt */
  INT_DDR                      = 109,              /**< DDR interrupt */
  INT_SWI                      = 110,              /**< Software interrupt */
  INT_NFC                      = 111,              /**< NAND flash controller interrupt */
  INT_USBHS                    = 112,              /**< USB high speed OTG interrupt */
  INT_LCD                      = 113,              /**< Graphical LCD interrupt */
  INT_CMP3                     = 114,              /**< CMP3 interrupt */
  INT_Tamper                   = 115,              /**< Tamper detect interrupt */
  INT_Reserved116              = 116,              /**< Reserved interrupt 116 */
  INT_FTM3                     = 117,              /**< FTM3 fault, overflow and channels interrupt */
  INT_ADC2                     = 118,              /**< ADC2 interrupt */
  INT_ADC3                     = 119,              /**< ADC3 interrupt */
  INT_I2S1_Tx                  = 120,              /**< I2S1 transmit interrupt */
  INT_I2S1_Rx                  = 121               /**< I2S1 receive interrupt */
} IRQInterruptIndex;

/**
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Peripheral type defines
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup Peripheral_defines Peripheral type defines
 * @{
 */


