zengwangfa/Underwater-Vehicle/software/18.8.21最终)/Chip/inc/kinetis/MK61F15.h
/* USB - Register array accessors */
#define USB0_ENDPT(index)                        USB_ENDPT_REG(USB0_BASE_PTR,index)

/**
 * @}
 */ /* end of group USB_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group USB_Peripheral */


/* ----------------------------------------------------------------------------
   -- USBDCD
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup USBDCD_Peripheral USBDCD
 * @{
 */

/** USBDCD - Peripheral register structure */
typedef struct USBDCD_MemMap {
  uint32_t CONTROL;                                /**< Control Register, offset: 0x0 */
  uint32_t CLOCK;                                  /**< Clock Register, offset: 0x4 */
  uint32_t STATUS;                                 /**< Status Register, offset: 0x8 */
  uint8_t RESERVED_0[4];
  uint32_t TIMER0;                                 /**< TIMER0 Register, offset: 0x10 */
  uint32_t TIMER1;                                 /**< , offset: 0x14 */
  uint32_t TIMER2;                                 /**< , offset: 0x18 */
} volatile *USBDCD_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- USBDCD - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup USBDCD_Register_Accessor_Macros USBDCD - Register accessor macros
 * @{
 */


/* USBDCD - Register accessors */
#define USBDCD_CONTROL_REG(base)                 ((base)->CONTROL)
#define USBDCD_CLOCK_REG(base)                   ((base)->CLOCK)
#define USBDCD_STATUS_REG(base)                  ((base)->STATUS)
#define USBDCD_TIMER0_REG(base)                  ((base)->TIMER0)
#define USBDCD_TIMER1_REG(base)                  ((base)->TIMER1)
#define USBDCD_TIMER2_REG(base)                  ((base)->TIMER2)

/**
 * @}
 */ /* end of group USBDCD_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- USBDCD Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup USBDCD_Register_Masks USBDCD Register Masks
 * @{
 */

/* CONTROL Bit Fields */
#define USBDCD_CONTROL_IACK_MASK                 0x1u
#define USBDCD_CONTROL_IACK_SHIFT                0
#define USBDCD_CONTROL_IF_MASK                   0x100u
#define USBDCD_CONTROL_IF_SHIFT                  8
#define USBDCD_CONTROL_IE_MASK                   0x10000u
#define USBDCD_CONTROL_IE_SHIFT                  16
#define USBDCD_CONTROL_START_MASK                0x1000000u
#define USBDCD_CONTROL_START_SHIFT               24
#define USBDCD_CONTROL_SR_MASK                   0x2000000u
#define USBDCD_CONTROL_SR_SHIFT                  25
/* CLOCK Bit Fields */
#define USBDCD_CLOCK_CLOCK_UNIT_MASK             0x1u
#define USBDCD_CLOCK_CLOCK_UNIT_SHIFT            0
#define USBDCD_CLOCK_CLOCK_SPEED_MASK            0xFFCu
#define USBDCD_CLOCK_CLOCK_SPEED_SHIFT           2
#define USBDCD_CLOCK_CLOCK_SPEED(x)              (((uint32_t)(((uint32_t)(x))<<USBDCD_CLOCK_CLOCK_SPEED_SHIFT))&USBDCD_CLOCK_CLOCK_SPEED_MASK)
/* STATUS Bit Fields */
#define USBDCD_STATUS_SEQ_RES_MASK               0x30000u
#define USBDCD_STATUS_SEQ_RES_SHIFT              16
#define USBDCD_STATUS_SEQ_RES(x)                 (((uint32_t)(((uint32_t)(x))<<USBDCD_STATUS_SEQ_RES_SHIFT))&USBDCD_STATUS_SEQ_RES_MASK)
#define USBDCD_STATUS_SEQ_STAT_MASK              0xC0000u
#define USBDCD_STATUS_SEQ_STAT_SHIFT             18
#define USBDCD_STATUS_SEQ_STAT(x)                (((uint32_t)(((uint32_t)(x))<<USBDCD_STATUS_SEQ_STAT_SHIFT))&USBDCD_STATUS_SEQ_STAT_MASK)
#define USBDCD_STATUS_ERR_MASK                   0x100000u
#define USBDCD_STATUS_ERR_SHIFT                  20
#define USBDCD_STATUS_TO_MASK                    0x200000u
#define USBDCD_STATUS_TO_SHIFT                   21
#define USBDCD_STATUS_ACTIVE_MASK                0x400000u
#define USBDCD_STATUS_ACTIVE_SHIFT               22
/* TIMER0 Bit Fields */
#define USBDCD_TIMER0_TUNITCON_MASK              0xFFFu
#define USBDCD_TIMER0_TUNITCON_SHIFT             0
#define USBDCD_TIMER0_TUNITCON(x)                (((uint32_t)(((uint32_t)(x))<<USBDCD_TIMER0_TUNITCON_SHIFT))&USBDCD_TIMER0_TUNITCON_MASK)
#define USBDCD_TIMER0_TSEQ_INIT_MASK             0x3FF0000u
#define USBDCD_TIMER0_TSEQ_INIT_SHIFT            16
#define USBDCD_TIMER0_TSEQ_INIT(x)               (((uint32_t)(((uint32_t)(x))<<USBDCD_TIMER0_TSEQ_INIT_SHIFT))&USBDCD_TIMER0_TSEQ_INIT_MASK)
/* TIMER1 Bit Fields */
#define USBDCD_TIMER1_TVDPSRC_ON_MASK            0x3FFu
#define USBDCD_TIMER1_TVDPSRC_ON_SHIFT           0
#define USBDCD_TIMER1_TVDPSRC_ON(x)              (((uint32_t)(((uint32_t)(x))<<USBDCD_TIMER1_TVDPSRC_ON_SHIFT))&USBDCD_TIMER1_TVDPSRC_ON_MASK)
#define USBDCD_TIMER1_TDCD_DBNC_MASK             0x3FF0000u
#define USBDCD_TIMER1_TDCD_DBNC_SHIFT            16
#define USBDCD_TIMER1_TDCD_DBNC(x)               (((uint32_t)(((uint32_t)(x))<<USBDCD_TIMER1_TDCD_DBNC_SHIFT))&USBDCD_TIMER1_TDCD_DBNC_MASK)
/* TIMER2 Bit Fields */
#define USBDCD_TIMER2_CHECK_DM_MASK              0xFu
#define USBDCD_TIMER2_CHECK_DM_SHIFT             0
#define USBDCD_TIMER2_CHECK_DM(x)                (((uint32_t)(((uint32_t)(x))<<USBDCD_TIMER2_CHECK_DM_SHIFT))&USBDCD_TIMER2_CHECK_DM_MASK)
#define USBDCD_TIMER2_TVDPSRC_CON_MASK           0x3FF0000u
#define USBDCD_TIMER2_TVDPSRC_CON_SHIFT          16
#define USBDCD_TIMER2_TVDPSRC_CON(x)             (((uint32_t)(((uint32_t)(x))<<USBDCD_TIMER2_TVDPSRC_CON_SHIFT))&USBDCD_TIMER2_TVDPSRC_CON_MASK)

/**
 * @}
 */ /* end of group USBDCD_Register_Masks */


/* USBDCD - Peripheral instance base addresses */
/** Peripheral USBDCD base pointer */
#define USBDCD_BASE_PTR                          ((USBDCD_MemMapPtr)0x40035000u)

/* ----------------------------------------------------------------------------
   -- USBDCD - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup USBDCD_Register_Accessor_Macros USBDCD - Register accessor macros
 * @{
 */


/* USBDCD - Register instance definitions */
/* USBDCD */
#define USBDCD_CONTROL                           USBDCD_CONTROL_REG(USBDCD_BASE_PTR)
#define USBDCD_CLOCK                             USBDCD_CLOCK_REG(USBDCD_BASE_PTR)
#define USBDCD_STATUS                            USBDCD_STATUS_REG(USBDCD_BASE_PTR)
#define USBDCD_TIMER0                            USBDCD_TIMER0_REG(USBDCD_BASE_PTR)
#define USBDCD_TIMER1                            USBDCD_TIMER1_REG(USBDCD_BASE_PTR)
#define USBDCD_TIMER2                            USBDCD_TIMER2_REG(USBDCD_BASE_PTR)

/**
 * @}
 */ /* end of group USBDCD_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group USBDCD_Peripheral */


/* ----------------------------------------------------------------------------
   -- USBHS
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup USBHS_Peripheral USBHS
 * @{
 */

/** USBHS - Peripheral register structure */
typedef struct USBHS_MemMap {
  uint32_t ID;                                     /**< Identification Register, offset: 0x0 */
  uint32_t HWGENERAL;                              /**< General Hardware Parameters Register, offset: 0x4 */
  uint32_t HWHOST;                                 /**< Host Hardware Parameters Register, offset: 0x8 */
  uint32_t HWDEVICE;                               /**< Device Hardware Parameters Register, offset: 0xC */
  uint32_t HWTXBUF;                                /**< Transmit Buffer Hardware Parameters Register, offset: 0x10 */
  uint32_t HWRXBUF;                                /**< Receive Buffer Hardware Parameters Register, offset: 0x14 */
  uint8_t RESERVED_0[104];
  uint32_t GPTIMER0LD;                             /**< General Purpose Timer n Load Register, offset: 0x80 */
  uint32_t GPTIMER0CTL;                            /**< General Purpose Timer n Control Register, offset: 0x84 */
  uint32_t GPTIMER1LD;                             /**< General Purpose Timer n Load Register, offset: 0x88 */
  uint32_t GPTIMER1CTL;                            /**< General Purpose Timer n Control Register, offset: 0x8C */
  uint8_t RESERVED_1[112];
  uint16_t HCIVERSION;                             /**< Host Controller Interface Version Register, offset: 0x100 */
  uint8_t RESERVED_2[1];
  uint8_t CAPLENGTH;                               /**< Capability Registers Length Register, offset: 0x103 */
  uint32_t HCSPARAMS;                              /**< Host Controller Structural Parameters Register, offset: 0x104 */
  uint32_t HCCPARAMS;                              /**< Host Controller Capability Parameters Register, offset: 0x108 */
  uint8_t RESERVED_3[22];
  uint16_t DCIVERSION;                             /**< Device Controller Interface Version, offset: 0x122 */
  uint32_t DCCPARAMS;                              /**< Device Controller Capability Parameters, offset: 0x124 */
  uint8_t RESERVED_4[24];
  uint32_t USBCMD;                                 /**< USB Command Register, offset: 0x140 */
  uint32_t USBSTS;                                 /**< USB Status Register, offset: 0x144 */
  uint32_t USBINTR;                                /**< USB Interrupt Enable Register, offset: 0x148 */
  uint32_t FRINDEX;                                /**< Frame Index Register, offset: 0x14C */
  uint8_t RESERVED_5[4];
  union {                                          /* offset: 0x154 */
    uint32_t DEVICEADDR;                             /**< Device Address Register, offset: 0x154 */
    uint32_t PERIODICLISTBASE;                       /**< Periodic Frame List Base Address Register, offset: 0x154 */
  };
  union {                                          /* offset: 0x158 */
    uint32_t ASYNCLISTADDR;                          /**< Current Asynchronous List Address Register, offset: 0x158 */
    uint32_t EPLISTADDR;                             /**< Endpoint List Address Register, offset: 0x158 */
  };
  uint32_t TTCTRL;                                 /**< Host TT Asynchronous Buffer Control, offset: 0x15C */
  uint32_t BURSTSIZE;                              /**< Master Interface Data Burst Size Register, offset: 0x160 */
  uint32_t TXFILLTUNING;                           /**< Transmit FIFO Tuning Control Register, offset: 0x164 */
  uint8_t RESERVED_6[8];
  uint32_t ULPI_VIEWPORT;                          /**< ULPI Register Access, offset: 0x170 */
  uint8_t RESERVED_7[12];
  uint32_t CONFIGFLAG;                             /**< Configure Flag Register, offset: 0x180 */
  uint32_t PORTSC1;                                /**< Port Status and Control Registers, offset: 0x184 */
  uint8_t RESERVED_8[28];
  uint32_t OTGSC;                                  /**< On-the-Go Status and Control Register, offset: 0x1A4 */
  uint32_t USBMODE;                                /**< USB Mode Register, offset: 0x1A8 */
  uint32_t EPSETUPSR;                              /**< Endpoint Setup Status Register, offset: 0x1AC */
  uint32_t EPPRIME;                                /**< Endpoint Initialization Register, offset: 0x1B0 */
  uint32_t EPFLUSH;                                /**< Endpoint Flush Register, offset: 0x1B4 */
  uint32_t EPSR;                                   /**< Endpoint Status Register, offset: 0x1B8 */
  uint32_t EPCOMPLETE;                             /**< Endpoint Complete Register, offset: 0x1BC */
  uint32_t EPCR0;                                  /**< Endpoint Control Register 0, offset: 0x1C0 */
  uint32_t EPCR[3];                                /**< Endpoint Control Register n, array offset: 0x1C4, array step: 0x4 */
} volatile *USBHS_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- USBHS - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup USBHS_Register_Accessor_Macros USBHS - Register accessor macros
 * @{
 */


/* USBHS - Register accessors */
#define USBHS_ID_REG(base)                       ((base)->ID)
#define USBHS_HWGENERAL_REG(base)                ((base)->HWGENERAL)
#define USBHS_HWHOST_REG(base)                   ((base)->HWHOST)
#define USBHS_HWDEVICE_REG(base)                 ((base)->HWDEVICE)
#define USBHS_HWTXBUF_REG(base)                  ((base)->HWTXBUF)
#define USBHS_HWRXBUF_REG(base)                  ((base)->HWRXBUF)
#define USBHS_GPTIMER0LD_REG(base)               ((base)->GPTIMER0LD)
#define USBHS_GPTIMER0CTL_REG(base)              ((base)->GPTIMER0CTL)
#define USBHS_GPTIMER1LD_REG(base)               ((base)->GPTIMER1LD)
#define USBHS_GPTIMER1CTL_REG(base)              ((base)->GPTIMER1CTL)
#define USBHS_HCIVERSION_REG(base)               ((base)->HCIVERSION)
#define USBHS_CAPLENGTH_REG(base)                ((base)->CAPLENGTH)
#define USBHS_HCSPARAMS_REG(base)                ((base)->HCSPARAMS)
#define USBHS_HCCPARAMS_REG(base)                ((base)->HCCPARAMS)
#define USBHS_DCIVERSION_REG(base)               ((base)->DCIVERSION)
#define USBHS_DCCPARAMS_REG(base)                ((base)->DCCPARAMS)
#define USBHS_USBCMD_REG(base)                   ((base)->USBCMD)
#define USBHS_USBSTS_REG(base)                   ((base)->USBSTS)
#define USBHS_USBINTR_REG(base)                  ((base)->USBINTR)
#define USBHS_FRINDEX_REG(base)                  ((base)->FRINDEX)
#define USBHS_DEVICEADDR_REG(base)               ((base)->DEVICEADDR)
#define USBHS_PERIODICLISTBASE_REG(base)         ((base)->PERIODICLISTBASE)
#define USBHS_ASYNCLISTADDR_REG(base)            ((base)->ASYNCLISTADDR)
#define USBHS_EPLISTADDR_REG(base)               ((base)->EPLISTADDR)
#define USBHS_TTCTRL_REG(base)                   ((base)->TTCTRL)
#define USBHS_BURSTSIZE_REG(base)                ((base)->BURSTSIZE)
#define USBHS_TXFILLTUNING_REG(base)             ((base)->TXFILLTUNING)
#define USBHS_ULPI_VIEWPORT_REG(base)            ((base)->ULPI_VIEWPORT)
#define USBHS_CONFIGFLAG_REG(base)               ((base)->CONFIGFLAG)
#define USBHS_PORTSC1_REG(base)                  ((base)->PORTSC1)
#define USBHS_OTGSC_REG(base)                    ((base)->OTGSC)
#define USBHS_USBMODE_REG(base)                  ((base)->USBMODE)
#define USBHS_EPSETUPSR_REG(base)                ((base)->EPSETUPSR)
#define USBHS_EPPRIME_REG(base)                  ((base)->EPPRIME)
#define USBHS_EPFLUSH_REG(base)                  ((base)->EPFLUSH)
#define USBHS_EPSR_REG(base)                     ((base)->EPSR)
#define USBHS_EPCOMPLETE_REG(base)               ((base)->EPCOMPLETE)
#define USBHS_EPCR0_REG(base)                    ((base)->EPCR0)
#define USBHS_EPCR_REG(base,index)               ((base)->EPCR[index])

/**
 * @}
 */ /* end of group USBHS_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- USBHS Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup USBHS_Register_Masks USBHS Register Masks
 * @{
 */

